import 'dart:math';
import 'package:flutter_app/models/gifts_model.dart';

final g0 = MakingGifts('سنيكرز', 'خدلك سنيكرز، أنت مش أنت وأنت جعان', 'assets/images/snickers.jpg');
/* ---------------------------------------------------------------------------------------------- */
final g1 = MakingGifts('كيت كات', 'خدلك بريك خدلك كيت كات', 'assets/images/kitkat.jpeg');
/* ---------------------------------------------------------------------------------------------- */
final g2 = MakingGifts('تويكس', 'وحدة الك والتانية الي', 'assets/images/twix.jpg');
/* ---------------------------------------------------------------------------------------------- */
final g3 = MakingGifts('إندومي', 'محبوب الجماهير', 'assets/images/indomie.jpg');
/* ---------------------------------------------------------------------------------------------- */
final g4 = MakingGifts('فاصلة منقوطة', 'بس طلاب المعلوماتية رح يعرفوا قيمة هالهدية ', 'assets/images/semecolon.jpg');
/* ---------------------------------------------------------------------------------------------- */
final g5 = MakingGifts('قلم حمرة', 'قومي تمكيجيلو', 'assets/images/rouge.jpg');
/* ---------------------------------------------------------------------------------------------- */
final g6 = MakingGifts('لوس باودر', 'ما بعرف شو المغزى بس بعتقد شي منيح', 'assets/images/luxury powder.jpeg');
/* ---------------------------------------------------------------------------------------------- */
final g7 = MakingGifts('مفتاح غاز', 'يمكنكم الاستعانة به في قتل الصراصير', 'assets/images/english key.jpg');
/* ---------------------------------------------------------------------------------------------- */
final g8 = MakingGifts('مقلاة', 'اقلوا بها المقالي', 'assets/images/meqlayah.jpg');
/* ---------------------------------------------------------------------------------------------- */
final g9 = MakingGifts('علامة ستين', 'ربما يبدو رقمًا عاديًا، ولكن له قصة عظيمة', 'assets/images/sixty.jpg');
/* ---------------------------------------------------------------------------------------------- */
var gifts = [g0, g1, g2, g3, g4, g5, g6, g7, g8, g9];

