import '../models/questions_model.dart';

final q0  = QuestionModel('ما هو اسم المكان الذي يعيش فيه النحل؟', 'خلية', 'وكر', 'خلية', 'جحر', 'عش', false);
/* ---------------------------------------------------------------------------------------------- */
final q1  = QuestionModel('ما هي أكبر مدينة في أوربا؟', 'إسطنبول', 'لندن', 'موسكو', 'إسطنبول', 'باريس', false);
/* ---------------------------------------------------------------------------------------------- */
final q2  = QuestionModel('كم عظمة في جسم الإنسان البالغ؟', '306', '250', '170', '360', '306', false);
/* ---------------------------------------------------------------------------------------------- */
final q3  = QuestionModel('في أي مدينة تقع ساعة بيغ بن؟', 'لندن', 'واشنطن', 'لندن', 'أنقرة', 'لوس أنجلوس', false);
/* ---------------------------------------------------------------------------------------------- */
final q4  = QuestionModel('إلى ماذا يشير مصطلح الذهب الأسود؟', 'البترول', 'النار', 'الفضة', 'الذهب','البترول', false);
/* ---------------------------------------------------------------------------------------------- */
final q5  = QuestionModel('ما هو أكثر الكائنات البحرية ذكاءً؟', 'الدولفين', 'الدولفين', 'الحوت الأزرق', 'الأخطبوط', 'الحبّار', false);
/* ---------------------------------------------------------------------------------------------- */
final q6  = QuestionModel('ما هي أكبر دولة عربية؟', 'السودان', 'الصومال', 'السودان', 'ليبيا', 'السعودية', false);
/* ---------------------------------------------------------------------------------------------- */
final q7  = QuestionModel('طلاب الهندسة المعلوماتية', 'قمر', 'قمر', 'قمر', 'قمر', 'قمر', false);
/* ---------------------------------------------------------------------------------------------- */
final q8  = QuestionModel('أين صُنعت أول كسوة للكعبة المشرفة؟', 'مصر', 'قطر', 'المغرب', 'الجزائر', 'مصر', false);
/* ---------------------------------------------------------------------------------------------- */
final q9  = QuestionModel('ما هي وحدة قياس شدة الصوت؟', 'الديسبل', 'الهرتز', 'الديسبل', 'الواط', 'الأمبير', false);
/* ---------------------------------------------------------------------------------------------- */
final q10 = QuestionModel('ما هي نسبة المياه من الكرة الأرضية؟', '71', '77', '75', '73', '71', false);
/* ---------------------------------------------------------------------------------------------- */
final q11 = QuestionModel('كم قلباً للأخطبوط؟', '3', '1', '2', '3', '4', false);
/* ---------------------------------------------------------------------------------------------- */
final q12 = QuestionModel('كم سجدة في القرآن الكريم؟', '15', '15', '23', '18', '11', false);
/* ---------------------------------------------------------------------------------------------- */
final q13 = QuestionModel('أين افتُتح أول متحف في العالم؟', 'القاهرة', 'باريس', 'القاهرة', 'مقديشو', 'أورفا', false);
/* ---------------------------------------------------------------------------------------------- */
final q14 = QuestionModel('أي مدينة تدعى مدينة الضباب؟', 'لندن', 'لندن', 'نيويورك', 'لوس أنجلوس', 'واشنطن', false);
/* ---------------------------------------------------------------------------------------------- */
final q15 = QuestionModel('أين تقع فلسطين؟', 'في قلوبنا', 'في قلوبنا', 'في قلوبنا', 'في قلوبنا', 'في قلوبنا', false);
/* ---------------------------------------------------------------------------------------------- */
final q16 = QuestionModel('ما هو اسم المكان الذي يعيش فيه الدجاج؟', 'قن', 'قن', 'جحر', 'خلية', 'عش', false);
/* ---------------------------------------------------------------------------------------------- */
final q17 = QuestionModel('أكثر دولة في العالم تنتج الفول السوداني هي؟', 'الهند', 'البرازيل', 'الهند', 'الأرجنتين', 'ألمانيا', false);
/* ---------------------------------------------------------------------------------------------- */
final q18 = QuestionModel('شركة سيارات ألمانية مشهورة:', 'BMW', 'BMW', 'KIA', 'HYUNDAI', 'DAEWOO', false);
/* ---------------------------------------------------------------------------------------------- */
final q19 = QuestionModel('من كم لون يتألف قوس قزح؟', '7', '5', '6', '7', '8', false);
/* ---------------------------------------------------------------------------------------------- */
final q20 = QuestionModel('كم عدد أحرف اللغة الإنكليزية؟', '26', '25', '26', '27', '28', false);
/* ---------------------------------------------------------------------------------------------- */
final q21 = QuestionModel('ما هي الدولة التي تشتهر بالسوشي؟', 'اليابان', 'الصين', 'كوريا الشمالية', 'اليابان', 'سنغافورة', false);
/* ---------------------------------------------------------------------------------------------- */
final q22 = QuestionModel('ما هو الكوكب الذي يدعى الكوكب الأحمر؟', 'المريخ', 'المريخ', 'الزهرة', 'عطارد', 'بلوتو', false);
/* ---------------------------------------------------------------------------------------------- */
final q23 = QuestionModel('كم عدد كواكب المجموعة الشمسية؟', '8', '6', '7', '8', '9', false);
/* ---------------------------------------------------------------------------------------------- */
final q24 = QuestionModel('ما هو أكبر حيوان في العالم؟', 'الحوت الأزرق', 'الفيل', 'الحوت الأزرق', 'الفهد', 'الزرافة', false);
/* ---------------------------------------------------------------------------------------------- */
final q25 = QuestionModel('القُدُسُ عاصمةٌ:', 'فلسطين', 'فلسطين', 'فلسطين', 'فلسطين', 'فلسطين', false);
/* ---------------------------------------------------------------------------------------------- */
final q26 = QuestionModel('ما هي وجدة قياس سرعة السفن؟', 'عقدة', 'كيلومتر', 'عقدة', 'قدم', 'إنش', false);
/* ---------------------------------------------------------------------------------------------- */
final q27 = QuestionModel('كم عضلة في جسم الإنسان؟', '620', '350', '620', '275', '563', false);
/* ---------------------------------------------------------------------------------------------- */
final q28 = QuestionModel('وخير ____ في الزمان كتاب', 'جليس', 'جليس', 'عدو', 'صاحب', 'جميل', false);
/* ---------------------------------------------------------------------------------------------- */
final q29 = QuestionModel('ما هي السورة التي ذكرت فيها البسملة مرتين؟', 'النمل', 'النحل', 'النمل', 'الذاريات', 'الناس', false);
/* ---------------------------------------------------------------------------------------------- */
final q30 = QuestionModel('مادة صلبة سهلة الكسر تُصنع من الرمل:', 'الزجاج', 'الزجاج', 'الألماس', 'الخشب', 'الحديد', false);
/* ---------------------------------------------------------------------------------------------- */
final q31 = QuestionModel('ضربني و____، سبقني واشتكى', 'بكى', 'هرب', 'ارتمى', 'عمى', 'بكى', false);
/* ---------------------------------------------------------------------------------------------- */
final q32 = QuestionModel('بمعنى استوى واكتمل نموّه', 'نضج', 'كّبُرَ', 'نضج', 'ركض', 'اختفى', false);
/* ---------------------------------------------------------------------------------------------- */
final q33 = QuestionModel('من هو الرسول الذي تربى في بيت عدوه؟', 'موسى', 'عيسى', 'موسى', 'إبراهيم', 'يونس', false);
/* ---------------------------------------------------------------------------------------------- */
final q34 = QuestionModel('بمعنى مرض شديد العدوى', 'وباء', 'وباء', 'بلاء', 'دهاء', 'غلاء', false);
/* ---------------------------------------------------------------------------------------------- */
final q35 = QuestionModel('نادي كرة قدم ألماني', 'بايرن ميونخ', 'ريال مدريد', 'برشلونة', 'أرسنال', 'بايرن ميونخ', false);
/* ---------------------------------------------------------------------------------------------- */
final q36 = QuestionModel('بمعنى أكره', 'أبغض', 'أبغض', 'أندم', 'أخجل', 'أحلم', false);
/* ---------------------------------------------------------------------------------------------- */
final q37 = QuestionModel('بمعنى فرقة عظيمة في الجيش', 'كتيبة', 'قطعة', 'حاجز', 'كتيبة', 'فرقة', false);
/* ---------------------------------------------------------------------------------------------- */
final q38 = QuestionModel('ما يوجبه المرء على نفسه من صدقة أو عبادة ونحوهما', 'نذر', 'نذر', 'زكاة', 'تضحية', 'قربان', false);
/* ---------------------------------------------------------------------------------------------- */
final q39 = QuestionModel('معدن أبيض يُدهن به النحاس كي لا يصدأ', 'قصدير', 'زئبق', 'تيتانيوم', 'قصدير', 'حديد', false);
/* ---------------------------------------------------------------------------------------------- */
final q40 = QuestionModel('بمعنى علا على سطح الماء', 'طفا', 'طفا', 'غرق', 'ظهر', 'غاص', false);
/* ---------------------------------------------------------------------------------------------- */
final q41 = QuestionModel('كم سنتيمترًا في المتر المكعب؟', 'مليون', 'مليون', 'مئة مليون', 'ألف', 'مئة ألف', false);
/* ---------------------------------------------------------------------------------------------- */
final q42 = QuestionModel('ما هو اسم الممثل الذي أدى دور آيرون مان؟', 'طوني ستارك', 'طوني ستارك', 'براد بيت', 'توم كروز', 'توم هاردي', false);
/* ---------------------------------------------------------------------------------------------- */
final q43 = QuestionModel('أكثر شخصية مشهورة في مسلسل باب الحارة؟', 'أبو شهاب', 'معتز', 'عصام', 'أبو شهاب', 'أبو حاتم', false);
/* ---------------------------------------------------------------------------------------------- */
final q44 = QuestionModel('أشهر محقق خيالي', 'كلاهما', 'شارلوك هولمز', 'كونان', 'كلاهما', 'لا أحد', false);
/* ---------------------------------------------------------------------------------------------- */
final q45 = QuestionModel('_____ بعين أمه غزال', 'القرد', 'الغراب', 'الأسد', 'القنفذ', 'القرد', false);
/* ---------------------------------------------------------------------------------------------- */
final q46 = QuestionModel('_____ قبل الدار', 'الجار', 'الجار', 'المال', 'الولد', 'البال', false);
/* ---------------------------------------------------------------------------------------------- */
final q47 = QuestionModel('دق الحديد وهو ____', 'حامي', 'بارد', 'حامي', 'مطعوج', 'مكسور', false);
/* ---------------------------------------------------------------------------------------------- */
final q48 = QuestionModel('أذن من ___ وأذن من عجين', 'طين', 'تراب', 'طين', 'تين', 'زجاج', false);
/* ---------------------------------------------------------------------------------------------- */
final q49 = QuestionModel('من شابه ____ فما ظلم', 'أباه', 'عمه', 'خاله', 'أباه', 'جده', false);
/* ---------------------------------------------------------------------------------------------- */
final q50 = QuestionModel('خذوا البنات من صدور ______', 'العمات', 'العمات', 'الخالات', 'الجدات', 'الأجداد', false);
/* ---------------------------------------------------------------------------------------------- */
final q51 = QuestionModel('ما هو الحيوان الذي يُلقب بسفينة الصحراء', 'الجمل', 'الجمل', 'الحصان', 'الفيل', 'الفهد', false);
/* ---------------------------------------------------------------------------------------------- */
final q52 = QuestionModel('ما هي عاصمة العراق؟', 'بغداد', 'الجزائر', 'الدوحة', 'عمان', 'بغداد', false);
/* ---------------------------------------------------------------------------------------------- */
final q53 = QuestionModel('كلمة بمعنى أجر', 'ثواب', 'زكاة', 'ثواب', 'قرض', 'مال', false);
/* ---------------------------------------------------------------------------------------------- */
final q54 = QuestionModel('ما هو معنى كلمة حياء؟', 'خجل', 'حياة', 'خجل', 'ثواب', 'دَين', false);
/* ---------------------------------------------------------------------------------------------- */
final q55 = QuestionModel('انعقاد اللسان عن الكلام هو:', 'الخرس', 'العمى', 'الطرش', 'الخرس', 'السمنة', false);
/* ---------------------------------------------------------------------------------------------- */
final q56 = QuestionModel('بمعنى سال دمعه:', 'ذرف', 'قتل', 'ذرف', 'نزل', 'ترك', false);
/* ---------------------------------------------------------------------------------------------- */
final q57 = QuestionModel('سلاح تقليدي قديم', 'رمح', 'مسدس', 'كلاشنكوف', 'رمح', 'قنبلة', false);
/* ---------------------------------------------------------------------------------------------- */
final q58 = QuestionModel('ليست من ألعاب الذكاء:', 'السلم والثعبان', 'السلم والثعبان', 'كانسة الألغام', 'الشطرنج', 'الداما', false);
/* ---------------------------------------------------------------------------------------------- */
final q59 = QuestionModel('عكس الخبيث:', 'الطيب', 'الميت', 'الطيب', 'القاتل', 'الماكر', false);
/* ---------------------------------------------------------------------------------------------- */
final q60 = QuestionModel('من هو الخال الوحيد لأولاد عمتك؟', 'والدك', 'خالك', 'جدك', 'والدك', 'لا أحد', false);
/* ---------------------------------------------------------------------------------------------- */
final q61 = QuestionModel('يتكلم بلا لسان ويسمع بلا أذن', 'الهاتف', 'الهاتف', 'النار', 'الحاسوب', 'البطريق', false);
/* ---------------------------------------------------------------------------------------------- */
final q62 = QuestionModel('ما هو الشيء الذي لا يمشي إلا بالضرب؟', 'المسمار', 'الحمار', 'المسمار', 'المطرقة', 'المفتاح', false);
/* ---------------------------------------------------------------------------------------------- */
final q63 = QuestionModel('كم عدد أيام شهر تشرين الثاني؟', '30', '28', '29', '30', '31', false);
/* ---------------------------------------------------------------------------------------------- */
final q64 = QuestionModel('كم عدد أيام شهر تشرين الأول؟', '31', '28', '29', '30', '31', false);
/* ---------------------------------------------------------------------------------------------- */
final q65 = QuestionModel('ما هو رمز الشركة المنتجة للآيفون؟', 'تفاحة', 'تفاحة', 'سيارة', 'هاتف', 'أحرف إنكليزية', false);
/* ---------------------------------------------------------------------------------------------- */
final q66 = QuestionModel('ماذا يسمى الغطاء الميت تحت الشجرة؟', 'اللحاء', 'الميناء', 'اللحاء', 'الرحيق', 'الصمغ', false);
/* ---------------------------------------------------------------------------------------------- */
final q67 = QuestionModel('ما هو الطب الذي يهتم بدراسة أمراض الحيوان؟', 'البيطري', 'النباتي', 'الشعاعي', 'البيطري', 'الكيماوي', false);
/* ---------------------------------------------------------------------------------------------- */
final q68 = QuestionModel('ما هي الدولة التي عاصمتها كابل؟', 'أفغانستان', 'كردستان', 'أفغانستان', 'أذربيجان', 'روسيا', false);
/* ---------------------------------------------------------------------------------------------- */
final q69 = QuestionModel('كم عدد أرجل البيانو الكبير؟', '3', '10', '7', '5', '3', false);
/* ---------------------------------------------------------------------------------------------- */
final q70 = QuestionModel('أي من الآلات الموسيقية ليست وترية؟', 'الناي', 'العود', 'الكمان', 'الناي', 'التشيلو', false);
/* ---------------------------------------------------------------------------------------------- */
final q71 = QuestionModel('ماذا يسمى الشخص الذي فقد كلا والديه أو أحدهما قبل أن يبلغ الحلم؟', 'يتيم', 'يتيم', 'مسكين', 'ابن سبيل', 'جاهل', false);
/* ---------------------------------------------------------------------------------------------- */
final q72 = QuestionModel('تُستعمل لجمع وادخار النقود', 'حصالة', 'علبة', 'حصالة', 'سيارة', 'درج', false);
/* ---------------------------------------------------------------------------------------------- */
final q73 = QuestionModel('أي من الأسماء التالية ليس اسمًا لبرنامج تصفح الإنترنت؟', 'بلوتوث', 'كروم', 'فايرفوكس', 'بلوتوث', 'انترنت إكسبلورر', false);
/* ---------------------------------------------------------------------------------------------- */
final q74 = QuestionModel('____ ليست آلة حادة', 'مطرقة', 'سكين', 'مطرقة', 'سيف', 'مقصلة', false);
/* ---------------------------------------------------------------------------------------------- */
final q75 = QuestionModel('ما هو اسم الحيوان المذكور في قصة النبي سليمان؟', 'النملة', 'النملة', 'النحلة', 'الغراب', 'البلبل', false);
/* ---------------------------------------------------------------------------------------------- */
final q76 = QuestionModel('كان يُستعمل في التحكم بالسفن', 'شراع', 'دفة', 'شراع', 'محرك', 'مرساة', false);
/* ---------------------------------------------------------------------------------------------- */
final q77 = QuestionModel('الهارمونيكا من الآلات الــــ _____', 'نفخية', 'وترية', 'نفخية', 'وترية ونفخية', 'ليست آلة', false);
/* ---------------------------------------------------------------------------------------------- */
final q78 = QuestionModel('بمعنى كلمة زوج المرأة', 'بعل', 'بعل', 'خاطب', 'مخطوب', 'طلاق', false);
/* ---------------------------------------------------------------------------------------------- */
final q79 = QuestionModel('ما هي الظاهرة الفلكية التي يحجب فيها القمر ضوء الشمس؟', 'الكسوف', 'الخسوف', 'الكسوف', 'المد والجزر', 'لا شيء مما سبق', false);
/* ---------------------------------------------------------------------------------------------- */
final q80 = QuestionModel('ما هو الحيوان الذي يستعين به رعاة الغنم؟', 'كلب', 'ذئب', 'ثعلب', 'كلب', 'قنفذ', false);
/* ---------------------------------------------------------------------------------------------- */
final q81 = QuestionModel('من أجمل صفحات الفيسبوك الديرية', 'للديريين فقط', 'للديريين فقط', 'شال', 'بليغ', 'رفيف', false);
/* ---------------------------------------------------------------------------------------------- */
final q82 = QuestionModel('ماذا يُسمى اتفاق أواخر الجُمل في الحروف؟', 'السجع', 'القافية', 'المقامة', 'الطباق', 'السجع', false);
/* ---------------------------------------------------------------------------------------------- */
List<QuestionModel> Q = [q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20,
         q21, q22, q23, q24, q25, q26, q27, q28, q29, q30, q31, q32, q33, q34, q35, q36, q37, q38, q39,
         q40, q41, q42, q43, q44, q45, q46, q47, q48, q49, q50, q51, q52, q53, q54, q55, q56, q57, q58,
         q59, q60, q61, q62, q63, q64, q65, q66, q67, q68, q69, q70, q71, q72, q73, q74, q75, q76, q77,
         q78, q79, q80, q81, q82];